// 1. Создайте пуcтой массив. С помощью цикла заполните массив числами, где каждое число
// равно квадрату своего номера. (длина массива должна быть 10)

// let arr=[];
// for(let i=0;i < 10;i++){
//     arr.push(1*i**2);
   
// }console.log(arr);


// 2. Создать случайный массив из 10 чисел. Вывести на экран
// количество четных чисел из этого массива.

// let col=0;
// let arr=[1,2,34,4,190,6,75,8,9,10];
// for(let i=0;i<arr.length;i++){
//     if(arr[i]%2===0){
//       col=col+1;
//     }
// }console.log(col);


// 3. Создать случайный массив из 10 чисел. Вывести на экран
// наибольшее число из этого массива.
// let num=0;
// let arr=[125,73,45,90,170,250,34,120,19,21];
// for(let i=0;i < arr.length;i++){
//     if(arr[i] > num){
//         num=arr[i];
//     }
// }console.log(num);


// 4. Дана строка «Мы любим JavaScript». Используя
// метод split, создайте на основе это строки
// массив.(Вывод данных: Мы,любим,JavaScript).

// let str='Мы любим JavaScript';
// let arr=str.split(' ');
// alert(arr);
// console.log(arr);



// 5.Дан массив ["Мы","любим","JavaScript"]. Используя
// метод join, создайте и выведите строку. В качестве
// разделителя используйте "!" (Вывод данных: Мы!любим!JavaScript).

// let arr=["Мы","любим","JavaScript"];
// let str=arr.join('!');
// alert(str);
// console.log(str);

// 6.Дан массив ["Я","великий","программист!"] с
// помощью метода indexOf, вывести на экран
// номер позиции строки "программист!"


// let arr=["Я","великий","программист!"];
// console.log(arr.indexOf('программист!'));